matsch82/waveshare-esp32-s3-ble-temp-viz/sdkconfig.defaults
# Target -------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# Flash: 4 MB layout boots on both board revisions (V1: 4 MB, V2: 8 MB).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# PSRAM intentionally disabled: the app needs only a few KB of graphics RAM,
# and disabling it keeps one firmware compatible with V1 (quad) and V2 (octal).

# Serial console over the native USB-C port (USB Serial/JTAG)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Bluetooth: BLE only, NimBLE host, observer role only ----------------------
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=0

# FreeRTOS -------------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000

# LVGL fonts used by the UI --------------------------------------------------
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Larger main task stack needed for the repeated wake/sleep loop in debug mode
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Application-specific defaults (see main/Kconfig.projbuild)
CONFIG_APP_SENSOR_NAME_PREFIX="GV5171"
CONFIG_APP_FULL_REFRESH_EVERY=15
